[
    {
        "text": "Financial Expert Says OpenAI Is on the Verge of Running Out of Money",
        "created_at": 1768542767.0,
        "source": "Reddit JSON"
    },
    {
        "text": "State Department Threatens UK Over Grok Investigation, Because Only The US Is Allowed To Ban Foreign Apps",
        "created_at": 1768539202.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Six months later, President Mobile still hasn’t delivered preordered phones | Lawmakers seek FTC investigation, but President has taken control of the agency.",
        "created_at": 1768504765.0,
        "source": "Reddit JSON"
    },
    {
        "text": "‘ELITE’: The Palantir App ICE Uses to Find Neighborhoods to Raid | Internal ICE material and testimony from an official obtained by 404 Media provides the clearest link yet between the technological infrastructure Palantir is building for ICE and the agency’s activities on the ground",
        "created_at": 1768494166.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says",
        "created_at": 1768490825.0,
        "source": "Reddit JSON"
    },
    {
        "text": "DDR5 RAM prices now over 4x higher since September 2025",
        "created_at": 1768509628.0,
        "source": "Reddit JSON"
    },
    {
        "text": "AI resume tool error pushed new ICE agents into the field without proper training.",
        "created_at": 1768516927.0,
        "source": "Reddit JSON"
    },
    {
        "text": "President, Ellison Wage War On ‘Woke Netflix’ In Effort To Scuttle Warner Brothers Deal, Dominate U.S. Media",
        "created_at": 1768494729.0,
        "source": "Reddit JSON"
    },
    {
        "text": "‘It’s AI blackface’: social media account hailed as the Aboriginal Steve Irwin is an AI character created in New Zealand",
        "created_at": 1768513448.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Verizon gets approval to make it harder for customers to leave",
        "created_at": 1768515029.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Iran’s internet shutdown is now one of its longest ever, as protests continue",
        "created_at": 1768521373.0,
        "source": "Reddit JSON"
    },
    {
        "text": "X still allowing users to post sexualised images generated by Grok AI tool",
        "created_at": 1768548437.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Scientists Develop Spray-On Powder That Instantly Seals Life-Threatening Wounds",
        "created_at": 1768482542.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Grok now bans illegal porn generation, after monetizing it",
        "created_at": 1768486336.0,
        "source": "Reddit JSON"
    },
    {
        "text": "New One-Click Microsoft Copilot Vulnerability Grants Attackers Undetected Access to Sensitive Data",
        "created_at": 1768541305.0,
        "source": "Reddit JSON"
    },
    {
        "text": "TSMC 'very nervous' about AI bubble concerns despite another record-setting quarter, but assured of demand — CEO says careless investment 'would be a disaster for TSMC for sure,' company will invest $52-$56 billion in capex",
        "created_at": 1768522467.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Gemini is winning: Three years after being caught off guard by ChatGPT, Gemini appears to have everything it needs to take down OpenAI and everyone else",
        "created_at": 1768486185.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Japan calls on X to take measures against AI-generated sexualized images",
        "created_at": 1768547452.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Five British families sue TikTok over deaths of their children in landmark US case",
        "created_at": 1768551410.0,
        "source": "Reddit JSON"
    },
    {
        "text": "World-first EV battery tech debuts with 595km of range from just 10 minutes of charging",
        "created_at": 1768541616.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Microsoft scrambles to quell fury around its new AI data centers",
        "created_at": 1768477861.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Spotify is hiking prices again / Premium, Duo, Family, and Student users in the US will be charged more from their next billing date.",
        "created_at": 1768481249.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Supreme Court Hacked, Proving Its Cybersecurity Is As Robust As Its Ethical Code",
        "created_at": 1768436005.0,
        "source": "Reddit JSON"
    },
    {
        "text": "AI may be everywhere, but it's nowhere in recent productivity statistics",
        "created_at": 1768467438.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Verizon Outage: Network Gives Customers $20 Credit After 10-Hour Disruption",
        "created_at": 1768543559.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Website that leaked info about ICE agents is down after cyberattack.",
        "created_at": 1768430297.0,
        "source": "Reddit JSON"
    },
    {
        "text": "FBI fights leaks by seizing Washington Post reporter’s phone, laptops, and watch | FBI searches home and devices of reporter who has over 1,100 government contacts.",
        "created_at": 1768438663.0,
        "source": "Reddit JSON"
    },
    {
        "text": "A simple CodeBuild flaw put every AWS environment at risk – and pwned 'the central nervous system of the cloud'",
        "created_at": 1768534104.0,
        "source": "Reddit JSON"
    },
    {
        "text": "UK police admit Microsoft Copilot mistake; that banned football fans from a match",
        "created_at": 1768541347.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Wikipedia inks AI deals with Microsoft, Meta and Perplexity as it marks 25th birthday",
        "created_at": 1768492178.0,
        "source": "Reddit JSON"
    },
    {
        "text": "I spent a year on Linux and forgot to miss Windows",
        "created_at": 1768491728.0,
        "source": "Reddit JSON"
    },
    {
        "text": "These companies advertised on X as Grok produced sexualized images of kids",
        "created_at": 1768503156.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Matthew McConaughey Trademarks Himself to Fight AI Misuse",
        "created_at": 1768467250.0,
        "source": "Reddit JSON"
    },
    {
        "text": "NVIDIA Reportedly Ends GeForce RTX 5070 Ti Production, RTX 5060 Ti 16 GB Next",
        "created_at": 1768489768.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Wikipedia turns 25 today but faces more threats than ever before",
        "created_at": 1768481316.0,
        "source": "Reddit JSON"
    },
    {
        "text": "The Only 'Eyes-Off' Driving System For Personal Cars In America Is Dead",
        "created_at": 1768477555.0,
        "source": "Reddit JSON"
    },
    {
        "text": "China Tightens Restrictions on High-Frequency Traders, Dismantling Data Centers",
        "created_at": 1768552425.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Wikipedia signs AI training deals with Microsoft, Meta, and Amazon | Wikimedia Enterprise signs Microsoft, Meta, Amazon, Perplexity, and Mistral AI to paid deals",
        "created_at": 1768493417.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Hundreds of Millions of Audio Devices Need a Patch to Prevent Wireless Hacking and Tracking",
        "created_at": 1768496107.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Bandcamp becomes the first major music platform to ban AI content",
        "created_at": 1768414854.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Jeff Bezos said the quiet part out loud — hopes that you'll give up your PC to rent one from the cloud",
        "created_at": 1768404826.0,
        "source": "Reddit JSON"
    },
    {
        "text": "'Warhammer' Maker Games Workshop Bans Its Staff From Using AI in Its Content or Designs, Says None of Its Senior Managers Are Currently Excited About the Tech",
        "created_at": 1768426173.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Digg launches its new Reddit rival to the public",
        "created_at": 1768423234.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Taiwan to invest $250B in US semiconductor manufacturing",
        "created_at": 1768522348.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Verizon to issue $20 credits to customers affected by cell service outage",
        "created_at": 1768503110.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Australia social media ban hits 4.7 million teen accounts in first month",
        "created_at": 1768505524.0,
        "source": "Reddit JSON"
    },
    {
        "text": "The AI lab revolving door spins ever faster",
        "created_at": 1768522399.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Will Google Ever Have to Pay for Its Sins?",
        "created_at": 1768488996.0,
        "source": "Reddit JSON"
    },
    {
        "text": "AI’s Hacking Skills Are Approaching an ‘Inflection Point’ | AI models are getting so good at finding vulnerabilities that some experts say the tech industry might need to rethink how software is built.",
        "created_at": 1768498375.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Sadiq Khan to urge ministers to act over ‘colossal’ impact of AI on London jobs",
        "created_at": 1768498242.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Wikipedia is 25, but some old fights are still going",
        "created_at": 1768468576.0,
        "source": "Reddit JSON"
    },
    {
        "text": "California to investigate xAI over Grok chatbot images, officials say",
        "created_at": 1768436650.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Silicon Valley's messiest breakup is definitely headed to court | TechCrunch",
        "created_at": 1768551132.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Americans Have Mixed Views of AI – and an Appetite for Regulation",
        "created_at": 1768509472.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Regulators say DoorDash and Uber Eats chiseled NYC delivery workers out of $550M in tips",
        "created_at": 1768419751.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Bandcamp bans purely AI-generated music from its platform | Indie music store says it wants fans to have confidence music was largely made by humans",
        "created_at": 1768418469.0,
        "source": "Reddit JSON"
    },
    {
        "text": "NASA's SpaceX Crew-11 safely splashes down off San Diego coast (1/15/2026)",
        "created_at": 1768501555.0,
        "source": "Reddit JSON"
    },
    {
        "text": "US tech giants allying with European far-right to strip back EU rules",
        "created_at": 1768410851.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Honda’s U.S.-Made Electric Mower Has A Bigger Battery Than The First Modern EV",
        "created_at": 1768477527.0,
        "source": "Reddit JSON"
    },
    {
        "text": "X says it has blocked Grok from editing images of real people into revealing clothing",
        "created_at": 1768485694.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Apple is Fighting for TSMC Capacity as Nvidia Takes Center Stage",
        "created_at": 1768503417.0,
        "source": "Reddit JSON"
    },
    {
        "text": "UK police blame Microsoft Copilot for intelligence mistake",
        "created_at": 1768422563.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Moon hotel startup hopes you get lunar lunacy, drop $1M deposit for 2032 stay",
        "created_at": 1768467336.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Waymo passenger jumps out of self-driving car after it stops on rail tracks near oncoming train",
        "created_at": 1768399139.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Personal information of 4,500 ICE and Border Patrol agents is leaked online",
        "created_at": 1768363045.0,
        "source": "Reddit JSON"
    },
    {
        "text": "France explores sending Eutelsat terminals to Iran amid internet blackout",
        "created_at": 1768500928.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Use of AI to harm women has only just begun, experts warn",
        "created_at": 1768397239.0,
        "source": "Reddit JSON"
    },
    {
        "text": "The Blob Is Back: Mercedes Quietly Relaunched Its EQ Electric Car Lineup",
        "created_at": 1768499806.0,
        "source": "Reddit JSON"
    },
    {
        "text": "US tech giants allying with European far-right to strip back EU rules",
        "created_at": 1768430136.0,
        "source": "Reddit JSON"
    },
    {
        "text": "How one startup is using prebiotics to try and ease the copper shortage",
        "created_at": 1768534014.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Signal’s founder launches an end-to-end encrypted AI assistant for fully private conversations",
        "created_at": 1768453103.0,
        "source": "Reddit JSON"
    },
    {
        "text": "FTC accuses AI search engine of 'rampant consumer deception'",
        "created_at": 1768463859.0,
        "source": "Reddit JSON"
    },
    {
        "text": "CrowdStrike shareholders lose battle to recoup losses from 2024 outage",
        "created_at": 1768429464.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Roblox's Age Verification Is a Joke",
        "created_at": 1768445404.0,
        "source": "Reddit JSON"
    },
    {
        "text": "QWERTY Phones Are Really Trying to Make a Comeback This Year",
        "created_at": 1768423473.0,
        "source": "Reddit JSON"
    },
    {
        "text": "US teachers union says it is leaving X over sexualized AI images of children",
        "created_at": 1768357903.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Dell wants £10m+ from VMware if Tesco case goes against it",
        "created_at": 1768534181.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Microsoft Copilot Reprompt exploit allowed attackers to steal your AI data",
        "created_at": 1768407756.0,
        "source": "Reddit JSON"
    },
    {
        "text": "AI Risks Leaving 25% of New College Grads Jobless, Senator Says",
        "created_at": 1768413670.0,
        "source": "Reddit JSON"
    },
    {
        "text": "President says that AI tech companies need to ‘pay their own way’ when it comes to their electricity consumption — says major changes are coming to ensure Americans don't 'pick up the tab' for data centers",
        "created_at": 1768382744.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Tesla, EEOC Plan Talks to Settle Factory Racism Suit",
        "created_at": 1768479512.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Mira Murati’s startup, Thinking Machines Lab, is losing two of its co-founders to OpenAI",
        "created_at": 1768446646.0,
        "source": "Reddit JSON"
    },
    {
        "text": "How prediction markets turned life into a dystopian gambling experiment",
        "created_at": 1768414515.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Deny, deny, admit: UK police used Copilot AI “hallucination” when banning football fans | Police finally come clean about botched use of AI tools",
        "created_at": 1768409770.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Lawsuit: DHS wants “unlimited subpoena authority” to unmask ICE critics | DHS is weirdly using import/export rules to expand its authority to identify online critics.",
        "created_at": 1768365327.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Personal Details of Thousands of Border Patrol and ICE Goons Allegedly Leaked in Huge Data Breach | A DHS whistleblower appears to have exposed data on federal immigration workers after the shooting of Renee Good.",
        "created_at": 1768332371.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Apple picks Google's Gemini to run AI-powered Siri coming this year",
        "created_at": 1768497459.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Grok is an Epistemic Weapon",
        "created_at": 1768409606.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Taiwan issues arrest warrant for Pete Lau, CEO of OnePlus",
        "created_at": 1768378922.0,
        "source": "Reddit JSON"
    },
    {
        "text": "When hardware goes end-of-life, companies need to open-source the software",
        "created_at": 1768397706.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Britain Awards Wind Farm Contracts That Will Power 12 Million Homes",
        "created_at": 1768429189.0,
        "source": "Reddit JSON"
    },
    {
        "text": "How a Chinese tech company is helping Iran catch protesters",
        "created_at": 1768416778.0,
        "source": "Reddit JSON"
    },
    {
        "text": "A new pendulum-based system devised in Spain allows energy to be extracted from vortex-induced vibrations in ocean currents. It's useful in environments where conventional turbines are difficult to install or maintain.",
        "created_at": 1768445333.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Buttons in cars: Australian crash testers are latest to require them",
        "created_at": 1768397628.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Senate passes a bill that would let nonconsensual deepfake victims sue / It comes amid the global uproar over X’s mass AI undressing of users on its platform.",
        "created_at": 1768337680.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Widespread Verizon outage prompts emergency alerts in Washington, New York City",
        "created_at": 1768418181.0,
        "source": "Reddit JSON"
    },
    {
        "text": "TSMC delivers another record quarter as profit jumps 35% fueled by robust AI chip demand",
        "created_at": 1768483286.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Never-before-seen Linux malware is “far more advanced than typical”",
        "created_at": 1768363487.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Here comes the advertising &amp; direct offers in AI chatbots",
        "created_at": 1768455333.0,
        "source": "Reddit JSON"
    },
    {
        "text": "Zorin OS 18 has reached 2 million downloads, with 1M+ Windows defections fueling one of Linux’s biggest growth stories in 2026",
        "created_at": 1768364179.0,
        "source": "Reddit JSON"
    }
]